#### Terraform Initialization `success`
#### Terraform Plan `failure`

<details><summary>Show Plan</summary>

```

terraform
data.sops_file.secrets: Reading...
data.sops_file.secrets: Read complete after 0s [id=-]
cloudflare_tunnel.kubernetes: Refreshing state... [id=9663fcd3-ee94-40b9-95ec-a74ec54a7610]
data.pagerduty_user.me: Reading...
data.azuread_application_published_app_ids.well_known: Reading...
data.azuread_client_config.current: Reading...
data.azuread_user.e2e_admin: Reading...
data.azuread_user.admin: Reading...
data.azuread_user.e2e_nonadmin_user: Reading...
data.azuread_client_config.current: Read complete after 0s [id=53174009-29d5-4c20-8bd0-0e2b2b0de6a8-1e4ad037-574d-4fba-a5c3-ed6c85fda2f5-4a8185bf-54b9-4d21-a286-fb744d13c64d]
data.azuread_application_published_app_ids.well_known: Read complete after 0s [id=appIds]
azuread_service_principal.msgraph: Refreshing state... [id=2bc0e2df-4abf-4297-a53b-4e304da70187]
data.azuread_user.e2e_nonadmin_user: Read complete after 0s [id=bf9b149f-8a2e-4c4e-bd9b-cfe690aa3c40]
cloudflare_record.apps["CyberChef"]: Refreshing state... [id=3e285514c143f57e4ad4232bc085fb96]
cloudflare_record.apps["Proxmox VE"]: Refreshing state... [id=fde116e796dfee8778b668c4e57a877e]
cloudflare_record.apps["Login"]: Refreshing state... [id=54e15f8537e8952b0bd0184f81f9f773]
data.pagerduty_user.me: Read complete after 1s [id=PT33KZP]
cloudflare_record.apps["Homepage"]: Refreshing state... [id=4b13b8b667a4f6d4b59f0dccea3986e4]
cloudflare_record.ssh["pve1"]: Refreshing state... [id=1c8fd3d475ee3ab13338d816fbf945f1]
cloudflare_record.ssh["kube3"]: Refreshing state... [id=d6fef1841eb21b58c3faadef143488b8]
cloudflare_record.ssh["pve3"]: Refreshing state... [id=f862705e50cea8654dd564898ddf4c01]
cloudflare_record.ssh["pve2"]: Refreshing state... [id=d9c4dded37e64ae2829740a37cedcc1f]
data.azuread_user.e2e_admin: Read complete after 1s [id=9b910c80-61bc-4df7-bf4b-77cb05ba057c]
cloudflare_record.ssh["kube1"]: Refreshing state... [id=cf43ac54bce93e0da250feaaa712cd08]
data.azuread_user.admin: Read complete after 1s [id=74953878-8eaf-421b-b557-b2485367566c]
cloudflare_record.ssh["kube2"]: Refreshing state... [id=fe62a91d7ece8f2b5ca5197c2b16baa4]
pagerduty_escalation_policy.default: Refreshing state... [id=PSPKP7V]
azuread_group.users: Refreshing state... [id=aac23af7-2d73-497f-b93c-b8ca4007638d]
azuread_group.administrators: Refreshing state... [id=64d004bd-9218-4fae-9919-0505ff5eeb8e]
pagerduty_service.proxmox: Refreshing state... [id=PFYIGYQ]
pagerduty_service.idrac: Refreshing state... [id=PJ86HND]
azuread_application.cloudflare: Refreshing state... [id=c8f4f59b-5697-4218-94d0-45ae43bf38de]
azuread_application.pomerium: Refreshing state... [id=1feb9fee-6af3-49b5-bb3f-2fb68ea03958]
azuread_application.proxmox: Refreshing state... [id=16399057-32a8-4025-bdea-fa59b7022326]
pagerduty_service_integration.proxmox: Refreshing state... [id=PXPT4AJ]
pagerduty_service_integration.idrac_pve1: Refreshing state... [id=PEY262Z]
pagerduty_service_integration.idrac_pve2: Refreshing state... [id=PALE5Q9]
azuread_application_password.cloudflare: Refreshing state... [id=c8f4f59b-5697-4218-94d0-45ae43bf38de/password/f69ce345-3c33-4959-b5ca-67de52396237]
azuread_service_principal.cloudflare: Refreshing state... [id=e86a6d4e-181a-40b5-93a2-134075648512]
azuread_group_member.users_e2e_nonadmin_user: Refreshing state... [id=aac23af7-2d73-497f-b93c-b8ca4007638d/member/bf9b149f-8a2e-4c4e-bd9b-cfe690aa3c40]
azuread_group_member.administrators_admin: Refreshing state... [id=64d004bd-9218-4fae-9919-0505ff5eeb8e/member/74953878-8eaf-421b-b557-b2485367566c]
azuread_group_member.administrators_e2e_admin: Refreshing state... [id=64d004bd-9218-4fae-9919-0505ff5eeb8e/member/9b910c80-61bc-4df7-bf4b-77cb05ba057c]
azuread_group_member.users_administrators: Refreshing state... [id=aac23af7-2d73-497f-b93c-b8ca4007638d/member/64d004bd-9218-4fae-9919-0505ff5eeb8e]
cloudflare_access_identity_provider.azuread: Refreshing state... [id=768c6b96-579e-4589-8258-ee9955de7659]
azuread_app_role_assignment.cloudflare_administrators: Refreshing state... [id=e86a6d4e-181a-40b5-93a2-134075648512/appRoleAssignment/vQTQZBiSrk-ZGQUF_17rjvRmRtfsitxHg8dWhtqfgQo]
azuread_service_principal_delegated_permission_grant.cloudflare: Refreshing state... [id=Tm1q6BoYtUCTohNAdWSFEt_iwCu_SpdCpTtOME2nAYc]
azuread_service_principal.proxmox: Refreshing state... [id=5fcd07e3-30e0-430f-9ada-7c4e1ca53534]
azuread_service_principal.pomerium: Refreshing state... [id=14c0e26a-2834-4be3-97f6-5b82483ecae3]
azuread_service_principal_delegated_permission_grant.proxmox: Refreshing state... [id=4wfNX-AwD0Oa2nxOHKU1NN_iwCu_SpdCpTtOME2nAYc]
azuread_app_role_assignment.proxmox_administrators: Refreshing state... [id=5fcd07e3-30e0-430f-9ada-7c4e1ca53534/appRoleAssignment/vQTQZBiSrk-ZGQUF_17rjmWSR3LfvShGqeT89TcYmzg]
azuread_app_role_assignment.pomerium_administrators: Refreshing state... [id=14c0e26a-2834-4be3-97f6-5b82483ecae3/appRoleAssignment/vQTQZBiSrk-ZGQUF_17rjpYG2T6FzfBCjNOFGI1AQSA]
azuread_service_principal_delegated_permission_grant.pomerium: Refreshing state... [id=auLAFDQo40uX9luCSD7K49_iwCu_SpdCpTtOME2nAYc]
azuread_app_role_assignment.pomerium_users: Refreshing state... [id=14c0e26a-2834-4be3-97f6-5b82483ecae3/appRoleAssignment/9zrCqnMtf0m5PLjKQAdjjXwUnxsw0OtNuwwrGPLTmGI]
cloudflare_access_application.ssh["kube3"]: Refreshing state... [id=2e1b7bab-a3e6-4386-bd72-d7852c5e0b50]
cloudflare_access_application.ssh["pve1"]: Refreshing state... [id=ec654f2e-6535-4714-8fdb-f35747f6f516]
cloudflare_access_application.apps["CyberChef"]: Refreshing state... [id=c6049007-dc43-4526-ac50-410919082ea8]
cloudflare_access_application.ssh["kube1"]: Refreshing state... [id=16d39824-bf26-4639-b00b-e5ae702b4c1c]
cloudflare_access_application.ssh["pve3"]: Refreshing state... [id=8e95e45b-b4e3-4828-b579-61a8e8129eff]
cloudflare_access_application.ssh["pve2"]: Refreshing state... [id=313b271e-fe74-4933-94af-35e18c828658]
cloudflare_access_application.ssh["kube2"]: Refreshing state... [id=8f634060-b409-49a1-9e85-21bd1b6d6b85]
cloudflare_access_application.apps["Proxmox VE"]: Refreshing state... [id=8f6b131e-df37-4158-897d-914c4d330aa2]
cloudflare_access_application.apps["Homepage"]: Refreshing state... [id=8bd2f815-f49c-465c-878d-7153f5673aa1]
cloudflare_access_application.apps["Login"]: Refreshing state... [id=67025d24-7bdc-4260-8a79-134ad390e286]
cloudflare_access_policy.apps_administrators["Homepage"]: Refreshing state... [id=c3a38941-7dfd-4314-9f56-2b66de5eeb62]
cloudflare_access_policy.apps_administrators["CyberChef"]: Refreshing state... [id=636005e3-9170-404c-a596-2f89017a1c29]
cloudflare_access_policy.apps_administrators["Login"]: Refreshing state... [id=af9033a4-948d-4c45-9d18-3fd4327b7bc8]
cloudflare_access_policy.apps_administrators["Proxmox VE"]: Refreshing state... [id=1ed0b4ef-5245-4724-824d-eaba7a0e074c]
cloudflare_access_policy.apps_users["Login"]: Refreshing state... [id=57e18576-e726-4e26-8c75-24829dbbd155]
cloudflare_access_policy.apps_users["Homepage"]: Refreshing state... [id=0cc3fe93-6d30-4f22-9c7c-ea073f70f60f]
cloudflare_access_policy.apps_users["CyberChef"]: Refreshing state... [id=020dacb3-47f0-404e-bf6f-e17ad08a2a63]
cloudflare_access_policy.ssh["kube2"]: Refreshing state... [id=19296fdf-f2a2-47ef-8e57-3a95591fdd0d]
cloudflare_access_policy.ssh["pve1"]: Refreshing state... [id=d3e42a8c-7598-410e-9139-dbe2c1e0880e]
cloudflare_access_policy.ssh["pve2"]: Refreshing state... [id=721686d0-4e20-4921-8fce-ba62d9647ffc]
cloudflare_access_policy.ssh["pve3"]: Refreshing state... [id=829fdb92-65fd-423d-a692-a1c9c3abe378]
cloudflare_access_policy.ssh["kube3"]: Refreshing state... [id=f7d1654b-511d-4021-a2fb-d9d003aa5c3e]
cloudflare_access_policy.ssh["kube1"]: Refreshing state... [id=74db6d99-7de8-4346-83dc-75d1a3f8a577]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform planned the following actions, but then encountered a problem:

  # cloudflare_access_application.apps["Cloudflare Tunnel Healthcheck"] will be created
  + resource "cloudflare_access_application" "apps" {
      + account_id                = (sensitive value)
      + allowed_idps              = [
          + "768c6b96-579e-4589-8258-ee9955de7659",
        ]
      + app_launcher_visible      = true
      + aud                       = (known after apply)
      + auto_redirect_to_identity = true
      + domain                    = "tunnel-health.homecentr.one"
      + enable_binding_cookie     = false
      + id                        = (known after apply)
      + name                      = "Cloudflare Tunnel Healthcheck"
      + service_auth_401_redirect = false
      + session_duration          = "24h"
      + skip_interstitial         = false
      + type                      = "self_hosted"
      + zone_id                   = (known after apply)
    }

  # cloudflare_access_application.apps["CyberChef"] will be destroyed
  # (because key ["CyberChef"] is not in for_each map)
  - resource "cloudflare_access_application" "apps" {
      - account_id                 = (sensitive value) -> null
      - allowed_idps               = [
          - "768c6b96-579e-4589-8258-ee9955de7659",
        ] -> null
      - app_launcher_visible       = true -> null
      - aud                        = "7a4b2d7d6bd35046432ef634cfa9f034134312f523d7253b1620acd5a6f74764" -> null
      - auto_redirect_to_identity  = true -> null
      - domain                     = "cyberchef.homecentr.one" -> null
      - enable_binding_cookie      = false -> null
      - http_only_cookie_attribute = false -> null
      - id                         = "c6049007-dc43-4526-ac50-410919082ea8" -> null
      - name                       = "CyberChef" -> null
      - service_auth_401_redirect  = false -> null
      - session_duration           = "24h" -> null
      - skip_interstitial          = false -> null
      - type                       = "self_hosted" -> null
        # (4 unchanged attributes hidden)
    }

  # cloudflare_access_application.apps["Gatus"] will be created
  + resource "cloudflare_access_application" "apps" {
      + account_id                = (sensitive value)
      + allowed_idps              = [
          + "768c6b96-579e-4589-8258-ee9955de7659",
        ]
      + app_launcher_visible      = true
      + aud                       = (known after apply)
      + auto_redirect_to_identity = true
      + domain                    = "status.homecentr.one"
      + enable_binding_cookie     = false
      + id                        = (known after apply)
      + name                      = "Gatus"
      + service_auth_401_redirect = false
      + session_duration          = "24h"
      + skip_interstitial         = false
      + type                      = "self_hosted"
      + zone_id                   = (known after apply)
    }

  # cloudflare_access_application.apps["Pi-hole"] will be created
  + resource "cloudflare_access_application" "apps" {
      + account_id                = (sensitive value)
      + allowed_idps              = [
          + "768c6b96-579e-4589-8258-ee9955de7659",
        ]
      + app_launcher_visible      = true
      + aud                       = (known after apply)
      + auto_redirect_to_identity = true
      + domain                    = "pihole.homecentr.one"
      + enable_binding_cookie     = false
      + id                        = (known after apply)
      + name                      = "Pi-hole"
      + service_auth_401_redirect = false
      + session_duration          = "24h"
      + skip_interstitial         = false
      + type                      = "self_hosted"
      + zone_id                   = (known after apply)
    }

  # cloudflare_access_application.ssh["kube1"] will be destroyed
  # (because key ["kube1"] is not in for_each map)
  - resource "cloudflare_access_application" "ssh" {
      - account_id                 = (sensitive value) -> null
      - allowed_idps               = [
          - "768c6b96-579e-4589-8258-ee9955de7659",
        ] -> null
      - app_launcher_visible       = true -> null
      - aud                        = "2225b44c4d0d04bba3cb8aa7ed767144f3c3bc3927b0690f16b5c9f03955ebb0" -> null
      - auto_redirect_to_identity  = true -> null
      - domain                     = "kube1.homecentr.one" -> null
      - enable_binding_cookie      = false -> null
      - http_only_cookie_attribute = false -> null
      - id                         = "16d39824-bf26-4639-b00b-e5ae702b4c1c" -> null
      - name                       = "SSH / kube1.homecentr.one" -> null
      - service_auth_401_redirect  = false -> null
      - session_duration           = "24h" -> null
      - skip_interstitial          = false -> null
      - type                       = "self_hosted" -> null
        # (4 unchanged attributes hidden)
    }

  # cloudflare_access_application.ssh["kube2"] will be destroyed
  # (because key ["kube2"] is not in for_each map)
  - resource "cloudflare_access_application" "ssh" {
      - account_id                 = (sensitive value) -> null
      - allowed_idps               = [
          - "768c6b96-579e-4589-8258-ee9955de7659",
        ] -> null
      - app_launcher_visible       = true -> null
      - aud                        = "38b65dc345cd06187d028ea141c314243ecf85cc6c0b6f0c96bc713581329c7a" -> null
      - auto_redirect_to_identity  = true -> null
      - domain                     = "kube2.homecentr.one" -> null
      - enable_binding_cookie      = false -> null
      - http_only_cookie_attribute = false -> null
      - id                         = "8f634060-b409-49a1-9e85-21bd1b6d6b85" -> null
      - name                       = "SSH / kube2.homecentr.one" -> null
      - service_auth_401_redirect  = false -> null
      - session_duration           = "24h" -> null
      - skip_interstitial          = false -> null
      - type                       = "self_hosted" -> null
        # (4 unchanged attributes hidden)
    }

  # cloudflare_access_application.ssh["kube3"] will be destroyed
  # (because key ["kube3"] is not in for_each map)
  - resource "cloudflare_access_application" "ssh" {
      - account_id                 = (sensitive value) -> null
      - allowed_idps               = [
          - "768c6b96-579e-4589-8258-ee9955de7659",
        ] -> null
      - app_launcher_visible       = true -> null
      - aud                        = "21cbbc079ecddeb63a7966acb239d552c05b5fb5f6e9499f7260f2541d244e87" -> null
      - auto_redirect_to_identity  = true -> null
      - domain                     = "kube3.homecentr.one" -> null
      - enable_binding_cookie      = false -> null
      - http_only_cookie_attribute = false -> null
      - id                         = "2e1b7bab-a3e6-4386-bd72-d7852c5e0b50" -> null
      - name                       = "SSH / kube3.homecentr.one" -> null
      - service_auth_401_redirect  = false -> null
      - session_duration           = "24h" -> null
      - skip_interstitial          = false -> null
      - type                       = "self_hosted" -> null
        # (4 unchanged attributes hidden)
    }

  # cloudflare_access_policy.apps_administrators["Cloudflare Tunnel Healthcheck"] will be created
  + resource "cloudflare_access_policy" "apps_administrators" {
      + account_id     = (sensitive value)
      + application_id = (known after apply)
      + decision       = "allow"
      + id             = (known after apply)
      + name           = "AD Group / Administrators"
      + precedence     = 1
      + zone_id        = (known after apply)

      + include {
          + azure {
              + id                   = [
                  + "64d004bd-9218-4fae-9919-0505ff5eeb8e",
                ]
              + identity_provider_id = "768c6b96-579e-4589-8258-ee9955de7659"
            }
        }
    }

  # cloudflare_access_policy.apps_administrators["CyberChef"] will be destroyed
  # (because key ["CyberChef"] is not in for_each map)
  - resource "cloudflare_access_policy" "apps_administrators" {
      - account_id     = (sensitive value) -> null
      - application_id = "c6049007-dc43-4526-ac50-410919082ea8" -> null
      - decision       = "allow" -> null
      - id             = "636005e3-9170-404c-a596-2f89017a1c29" -> null
      - name           = "AD Group / Administrators" -> null
      - precedence     = 1 -> null

      - include {
          - any_valid_service_token = false -> null
          - certificate             = false -> null
          - device_posture          = [] -> null
          - email                   = [] -> null
          - email_domain            = [] -> null
          - everyone                = false -> null
          - geo                     = [] -> null
          - group                   = [] -> null
          - ip                      = [] -> null
          - ip_list                 = [] -> null
          - login_method            = [] -> null
          - service_token           = [] -> null
            # (2 unchanged attributes hidden)

          - azure {
              - id                   = [
                  - "64d004bd-9218-4fae-9919-0505ff5eeb8e",
                ] -> null
              - identity_provider_id = "768c6b96-579e-4589-8258-ee9955de7659" -> null
            }
        }
    }

  # cloudflare_access_policy.apps_administrators["Gatus"] will be created
  + resource "cloudflare_access_policy" "apps_administrators" {
      + account_id     = (sensitive value)
      + application_id = (known after apply)
      + decision       = "allow"
      + id             = (known after apply)
      + name           = "AD Group / Administrators"
      + precedence     = 1
      + zone_id        = (known after apply)

      + include {
          + azure {
              + id                   = [
                  + "64d004bd-9218-4fae-9919-0505ff5eeb8e",
                ]
              + identity_provider_id = "768c6b96-579e-4589-8258-ee9955de7659"
            }
        }
    }

  # cloudflare_access_policy.apps_administrators["Pi-hole"] will be created
  + resource "cloudflare_access_policy" "apps_administrators" {
      + account_id     = (sensitive value)
      + application_id = (known after apply)
      + decision       = "allow"
      + id             = (known after apply)
      + name           = "AD Group / Administrators"
      + precedence     = 1
      + zone_id        = (known after apply)

      + include {
          + azure {
              + id                   = [
                  + "64d004bd-9218-4fae-9919-0505ff5eeb8e",
                ]
              + identity_provider_id = "768c6b96-579e-4589-8258-ee9955de7659"
            }
        }
    }

  # cloudflare_access_policy.apps_users["Cloudflare Tunnel Healthcheck"] will be created
  + resource "cloudflare_access_policy" "apps_users" {
      + account_id     = (sensitive value)
      + application_id = (known after apply)
      + decision       = "allow"
      + id             = (known after apply)
      + name           = "AD Group / Users"
      + precedence     = 2
      + zone_id        = (known after apply)

      + include {
          + azure {
              + id                   = [
                  + "aac23af7-2d73-497f-b93c-b8ca4007638d",
                ]
              + identity_provider_id = "768c6b96-579e-4589-8258-ee9955de7659"
            }
        }
    }

  # cloudflare_access_policy.apps_users["CyberChef"] will be destroyed
  # (because key ["CyberChef"] is not in for_each map)
  - resource "cloudflare_access_policy" "apps_users" {
      - account_id     = (sensitive value) -> null
      - application_id = "c6049007-dc43-4526-ac50-410919082ea8" -> null
      - decision       = "allow" -> null
      - id             = "020dacb3-47f0-404e-bf6f-e17ad08a2a63" -> null
      - name           = "AD Group / Users" -> null
      - precedence     = 2 -> null

      - include {
          - any_valid_service_token = false -> null
          - certificate             = false -> null
          - device_posture          = [] -> null
          - email                   = [] -> null
          - email_domain            = [] -> null
          - everyone                = false -> null
          - geo                     = [] -> null
          - group                   = [] -> null
          - ip                      = [] -> null
          - ip_list                 = [] -> null
          - login_method            = [] -> null
          - service_token           = [] -> null
            # (2 unchanged attributes hidden)

          - azure {
              - id                   = [
                  - "aac23af7-2d73-497f-b93c-b8ca4007638d",
                ] -> null
              - identity_provider_id = "768c6b96-579e-4589-8258-ee9955de7659" -> null
            }
        }
    }

  # cloudflare_access_policy.apps_users["Gatus"] will be created
  + resource "cloudflare_access_policy" "apps_users" {
      + account_id     = (sensitive value)
      + application_id = (known after apply)
      + decision       = "allow"
      + id             = (known after apply)
      + name           = "AD Group / Users"
      + precedence     = 2
      + zone_id        = (known after apply)

      + include {
          + azure {
              + id                   = [
                  + "aac23af7-2d73-497f-b93c-b8ca4007638d",
                ]
              + identity_provider_id = "768c6b96-579e-4589-8258-ee9955de7659"
            }
        }
    }

  # cloudflare_access_policy.ssh["kube1"] will be destroyed
  # (because key ["kube1"] is not in for_each map)
  - resource "cloudflare_access_policy" "ssh" {
      - account_id     = (sensitive value) -> null
      - application_id = "16d39824-bf26-4639-b00b-e5ae702b4c1c" -> null
      - decision       = "allow" -> null
      - id             = "74db6d99-7de8-4346-83dc-75d1a3f8a577" -> null
      - name           = "AD Group / Administrators" -> null
      - precedence     = 1 -> null

      - include {
          - any_valid_service_token = false -> null
          - certificate             = false -> null
          - device_posture          = [] -> null
          - email                   = [] -> null
          - email_domain            = [] -> null
          - everyone                = false -> null
          - geo                     = [] -> null
          - group                   = [] -> null
          - ip                      = [] -> null
          - ip_list                 = [] -> null
          - login_method            = [] -> null
          - service_token           = [] -> null
            # (2 unchanged attributes hidden)

          - azure {
              - id                   = [
                  - "64d004bd-9218-4fae-9919-0505ff5eeb8e",
                ] -> null
              - identity_provider_id = "768c6b96-579e-4589-8258-ee9955de7659" -> null
            }
        }
    }

  # cloudflare_access_policy.ssh["kube2"] will be destroyed
  # (because key ["kube2"] is not in for_each map)
  - resource "cloudflare_access_policy" "ssh" {
      - account_id     = (sensitive value) -> null
      - application_id = "8f634060-b409-49a1-9e85-21bd1b6d6b85" -> null
      - decision       = "allow" -> null
      - id             = "19296fdf-f2a2-47ef-8e57-3a95591fdd0d" -> null
      - name           = "AD Group / Administrators" -> null
      - precedence     = 1 -> null

      - include {
          - any_valid_service_token = false -> null
          - certificate             = false -> null
          - device_posture          = [] -> null
          - email                   = [] -> null
          - email_domain            = [] -> null
          - everyone                = false -> null
          - geo                     = [] -> null
          - group                   = [] -> null
          - ip                      = [] -> null
          - ip_list                 = [] -> null
          - login_method            = [] -> null
          - service_token           = [] -> null
            # (2 unchanged attributes hidden)

          - azure {
              - id                   = [
                  - "64d004bd-9218-4fae-9919-0505ff5eeb8e",
                ] -> null
              - identity_provider_id = "768c6b96-579e-4589-8258-ee9955de7659" -> null
            }
        }
    }

  # cloudflare_access_policy.ssh["kube3"] will be destroyed
  # (because key ["kube3"] is not in for_each map)
  - resource "cloudflare_access_policy" "ssh" {
      - account_id     = (sensitive value) -> null
      - application_id = "2e1b7bab-a3e6-4386-bd72-d7852c5e0b50" -> null
      - decision       = "allow" -> null
      - id             = "f7d1654b-511d-4021-a2fb-d9d003aa5c3e" -> null
      - name           = "AD Group / Administrators" -> null
      - precedence     = 1 -> null

      - include {
          - any_valid_service_token = false -> null
          - certificate             = false -> null
          - device_posture          = [] -> null
          - email                   = [] -> null
          - email_domain            = [] -> null
          - everyone                = false -> null
          - geo                     = [] -> null
          - group                   = [] -> null
          - ip                      = [] -> null
          - ip_list                 = [] -> null
          - login_method            = [] -> null
          - service_token           = [] -> null
            # (2 unchanged attributes hidden)

          - azure {
              - id                   = [
                  - "64d004bd-9218-4fae-9919-0505ff5eeb8e",
                ] -> null
              - identity_provider_id = "768c6b96-579e-4589-8258-ee9955de7659" -> null
            }
        }
    }

  # cloudflare_record.apps["Cloudflare Tunnel Healthcheck"] will be created
  + resource "cloudflare_record" "apps" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "tunnel-health.homecentr.one"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = 1
      + type            = "CNAME"
      + value           = "9663fcd3-ee94-40b9-95ec-a74ec54a7610.cfargotunnel.com"
      + zone_id         = (sensitive value)
    }

  # cloudflare_record.apps["CyberChef"] will be destroyed
  # (because key ["CyberChef"] is not in for_each map)
  - resource "cloudflare_record" "apps" {
      - allow_overwrite = false -> null
      - created_on      = "2023-07-19T08:47:31.855465Z" -> null
      - hostname        = "cyberchef.homecentr.one" -> null
      - id              = "3e285514c143f57e4ad4232bc085fb96" -> null
      - metadata        = {
          - "auto_added"             = "false"
          - "managed_by_apps"        = "false"
          - "managed_by_argo_tunnel" = "false"
        } -> null
      - modified_on     = "2023-07-19T08:47:31.855465Z" -> null
      - name            = "cyberchef.homecentr.one" -> null
      - proxiable       = true -> null
      - proxied         = true -> null
      - tags            = [] -> null
      - ttl             = 1 -> null
      - type            = "CNAME" -> null
      - value           = "9663fcd3-ee94-40b9-95ec-a74ec54a7610.cfargotunnel.com" -> null
      - zone_id         = (sensitive value) -> null
        # (1 unchanged attribute hidden)
    }

  # cloudflare_record.apps["Gatus"] will be created
  + resource "cloudflare_record" "apps" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "status.homecentr.one"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = 1
      + type            = "CNAME"
      + value           = "9663fcd3-ee94-40b9-95ec-a74ec54a7610.cfargotunnel.com"
      + zone_id         = (sensitive value)
    }

  # cloudflare_record.apps["Pi-hole"] will be created
  + resource "cloudflare_record" "apps" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "pihole.homecentr.one"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = 1
      + type            = "CNAME"
      + value           = "9663fcd3-ee94-40b9-95ec-a74ec54a7610.cfargotunnel.com"
      + zone_id         = (sensitive value)
    }

  # cloudflare_record.ssh["kube1"] will be destroyed
  # (because key ["kube1"] is not in for_each map)
  - resource "cloudflare_record" "ssh" {
      - allow_overwrite = false -> null
      - created_on      = "2023-11-07T14:24:43.831396Z" -> null
      - hostname        = "kube1.homecentr.one" -> null
      - id              = "cf43ac54bce93e0da250feaaa712cd08" -> null
      - metadata        = {
          - "auto_added"             = "false"
          - "managed_by_apps"        = "false"
          - "managed_by_argo_tunnel" = "false"
        } -> null
      - modified_on     = "2023-11-07T14:24:43.831396Z" -> null
      - name            = "kube1.homecentr.one" -> null
      - proxiable       = true -> null
      - proxied         = true -> null
      - tags            = [] -> null
      - ttl             = 1 -> null
      - type            = "CNAME" -> null
      - value           = "9663fcd3-ee94-40b9-95ec-a74ec54a7610.cfargotunnel.com" -> null
      - zone_id         = (sensitive value) -> null
        # (1 unchanged attribute hidden)
    }

  # cloudflare_record.ssh["kube2"] will be destroyed
  # (because key ["kube2"] is not in for_each map)
  - resource "cloudflare_record" "ssh" {
      - allow_overwrite = false -> null
      - created_on      = "2023-11-07T14:24:43.336485Z" -> null
      - hostname        = "kube2.homecentr.one" -> null
      - id              = "fe62a91d7ece8f2b5ca5197c2b16baa4" -> null
      - metadata        = {
          - "auto_added"             = "false"
          - "managed_by_apps"        = "false"
          - "managed_by_argo_tunnel" = "false"
        } -> null
      - modified_on     = "2023-11-07T14:24:43.336485Z" -> null
      - name            = "kube2.homecentr.one" -> null
      - proxiable       = true -> null
      - proxied         = true -> null
      - tags            = [] -> null
      - ttl             = 1 -> null
      - type            = "CNAME" -> null
      - value           = "9663fcd3-ee94-40b9-95ec-a74ec54a7610.cfargotunnel.com" -> null
      - zone_id         = (sensitive value) -> null
        # (1 unchanged attribute hidden)
    }

  # cloudflare_record.ssh["kube3"] will be destroyed
  # (because key ["kube3"] is not in for_each map)
  - resource "cloudflare_record" "ssh" {
      - allow_overwrite = false -> null
      - created_on      = "2023-11-07T14:24:43.565561Z" -> null
      - hostname        = "kube3.homecentr.one" -> null
      - id              = "d6fef1841eb21b58c3faadef143488b8" -> null
      - metadata        = {
          - "auto_added"             = "false"
          - "managed_by_apps"        = "false"
          - "managed_by_argo_tunnel" = "false"
        } -> null
      - modified_on     = "2023-11-07T14:24:43.565561Z" -> null
      - name            = "kube3.homecentr.one" -> null
      - proxiable       = true -> null
      - proxied         = true -> null
      - tags            = [] -> null
      - ttl             = 1 -> null
      - type            = "CNAME" -> null
      - value           = "9663fcd3-ee94-40b9-95ec-a74ec54a7610.cfargotunnel.com" -> null
      - zone_id         = (sensitive value) -> null
        # (1 unchanged attribute hidden)
    }

Plan: 11 to add, 0 to change, 13 to destroy.

```

</details>

*Pusher: @lholota, Action: `pull_request`*